Catalogs/НастройкиПроверкиРеестров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиПроверкиРеестров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПозицияШапки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоИмени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияСРеестром</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПроверкиРеестров/Forms/ФормаВыбораСоответствий/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвтоЗначения = Неопределено;
	Если Не Параметры.Свойство("Авто", АвтоЗначения) Тогда
	
		Элементы.ИмяКолонки.ТолькоПросмотр = Ложь;
		Элементы.НомерКолонки.ТолькоПросмотр = Ложь;
		Возврат;
	
	КонецЕсли;
	
	Параметры.Свойство("Имя", ИмяКолонки);
	Параметры.Свойство("Номер", НомерКолонки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПустаяСтрока(НаборыТипов) Тогда
	
		НаборыТипов = "Все типы";
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ЗначенияЯчейки = Новый Структура;
	ЗначенияЯчейки.Вставить("Результат", Ложь);
	
	Если Не ЗначениеЗаполнено(ТипКолонки) Тогда
	
		Закрыть(ЗначенияЯчейки);
	
	КонецЕсли;
	
	ЗначенияЯчейки.Вставить("Результат", Истина);
	ЗначенияЯчейки.Вставить("Номер", НомерКолонки);
	ЗначенияЯчейки.Вставить("Имя", ИмяКолонки);
	ЗначенияЯчейки.Вставить("Тип", ТипКолонки);
	
	Закрыть(ЗначенияЯчейки);
	
КонецПроцедуры
